source/public/samples/tramas_recibido/datos_recibidos_abdcp_nuevos_ultimos_producion_20140716122118.txt

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="http://ws.inpac.telcordia.com"><env:Body><ns1:receiveMessageRequest><ns1:userID>59sbarrantes</ns1:userID><ns1:password>am9yZGFuMjM=</ns1:password><ns1:xmlMsg>&lt;MensajeABDCP xsi:noNamespaceSchemaLocation="SP.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
                           &lt;CabeceraMensaje&gt;&#13;
                                   &lt;IdentificadorMensaje&gt;20201405061500003&lt;/IdentificadorMensaje&gt;&#13;
                                   &lt;Remitente&gt;59&lt;/Remitente&gt;&#13;
                                   &lt;Destinatario&gt;00&lt;/Destinatario&gt;&#13;
                                   &lt;FechaCreacionMensaje&gt;20140716122118&lt;/FechaCreacionMensaje&gt;&#13;
                                   &lt;IdentificadorProceso&gt;20201405060110000&lt;/IdentificadorProceso&gt;&#13;
                           &lt;/CabeceraMensaje&gt;&#13;
                   &lt;CuerpoMensaje IdMensaje="CP"&gt;&#13;
                        &lt;ConsultaPrevia&gt;&#13;
                            &lt;CodigoReceptor&gt;59&lt;/CodigoReceptor&gt;&#13;
                            &lt;CodigoCedente&gt;80&lt;/CodigoCedente&gt;&#13;
                            &lt;TipoDocumentoIdentidad&gt;05&lt;/TipoDocumentoIdentidad&gt;&#13;
                            &lt;NumeroDocumentoIdentidad&gt;1&lt;/NumeroDocumentoIdentidad&gt;&#13;
                            &lt;CantidadNumeraciones&gt;1&lt;/CantidadNumeraciones&gt;&#13;
                            &lt;NumeracionSolicitada&gt;&#13;
                                  &lt;RangoNumeracion&gt;&#13;
                                    &lt;InicioRango&gt;17200801&lt;/InicioRango&gt;&#13;
                                    &lt;FinalRango&gt;17200801&lt;/FinalRango&gt;&#13;
                                    &lt;TipoPortabilidad&gt;01&lt;/TipoPortabilidad&gt;&#13;
                                  &lt;/RangoNumeracion&gt;&#13;
                            &lt;/NumeracionSolicitada&gt;&#13;
                            &lt;Observaciones&gt;&lt;/Observaciones&gt;&#13;
                            &lt;NombreContacto&gt;Santiago&lt;/NombreContacto&gt;&#13;
                            &lt;EmailContacto&gt;a@a.com&lt;/EmailContacto&gt;&#13;
                            &lt;TelefonoContacto&gt;73269990000&lt;/TelefonoContacto&gt;&#13;
                            &lt;FaxContacto&gt;73269990001&lt;/FaxContacto&gt;&#13;
                            &lt;TipoServicio&gt;1&lt;/TipoServicio&gt;&#13;
                            &lt;Cliente&gt;2&lt;/Cliente&gt;&#13;
                        &lt;/ConsultaPrevia&gt;&#13;
                    &lt;/CuerpoMensaje&gt;&#13;
                &lt;/MensajeABDCP&gt;</ns1:xmlMsg></ns1:receiveMessageRequest></env:Body></env:Envelope>
